use tokenizer::Tokenizer;

mod tokenizer;

fn main() {
    let text = "『おやすみなさい、七海さん』
さっきまで話していた陽信の言葉が今も耳に心地良く残っていて、私はそれを反芻していた。
別に男子と話すのは初めてと言うわけじゃないのに、彼との会話はドキドキさせられっぱなしだ。
まるで耳元に彼がいるみたいで、電話ってなんて凄い発明なんだと、私は顔も名前も知らない電話を発明してくれた人に感謝する。
……よく考えると男子と二人だけで話すのは初めてか。しかもこんな夜に……。
「なにこれー、ヤーバーイー……」
ベッドの上でうつ伏せになりながら足をバタバタと動かす。別に意味は無いのだが、何か動いていないと落ち着かないのだ。
もう、ダメだ。なんだか自分の気持ちが制御できない。本当に落ち着かない。ふわふわする。
「これじゃあ、初美と歩に反論できないじゃんー……」
今日は朝から信じられないことの連続だ。
朝、早く来すぎてどう時間を潰そうか考えていたら、彼はすぐに私のところに来てくれた。
変えた髪型に気付いてくれて、照れながら可愛いって言ってくれた。私はそんな陽信の方が可愛いと思ってしまった。
私から手を繋ごうと言い出して、そんな自分自身にビックリした。手汗とか大丈夫だったかな？
他にもほっぺをつつかれたり、一緒にお弁当を食べて……なんでか、『あーん』なんてしちゃったり。
よくよく考えたらあれ、間接キスじゃない!?
うわー、今気づいた……今更、恥ずかしくなってきちゃった……。私は、熱くなる両頬を抑えてベッドの上でまんまるくなる。
陽信も言ってよ……間接キスだねって……。
いやダメだ、そんなこと言われたら恥ずかしさできっと死んじゃう。陽信も絶対そんな事言わないだろうし……。
そして、今日の最後……放課後なんて、お買い物デートまでしちゃったりしたし……。
全部が全部、私にとって初めてのことだ。
彼氏ができたのもはじめてなのだから当然だけど……。
罰ゲームからできた彼氏だというのに……私は陽信と一緒にいるのがたまらなく楽しい。……もっと一緒にいたいと思えるくらいに。
その事に罪悪感があるのはどうしても拭えない。でも……。
私はチラリと、部屋にこっそりと置いている、陽信用のお弁当箱を見た。
彼に買ってもらった……私の宝物だ。
いや、買ってもらったってのはちょっと違うかな……よく考えると彼が自分で買うと言うのは当たり前の話で……なんだかふわふわと舞い上がりすぎて、言われるまで気付かなかった。
でも、なんだかプレゼントをもらったみたいで、今も台所に隠すんじゃなくて、こっそりと部屋に置いている。
これから毎日、私はこのお弁当箱に、私の手料理を詰め込んで彼に渡すんだ。
それがたまらなく幸せに思えてならない。
『愛妻弁当だー？』
途端に、ニヤニヤとした初美と歩の笑顔が頭の中に思い浮かぶ。
「まだ愛妻じゃないから！」
ベッドの上でガバリと起き上がった私はそこにいない二人に言い訳をする。
うぅ……あの二人が変なこと言うから……。
料理は愛情だというのだから確かに愛情は込める。愛情は込めるけど……それはお母さん達と同じくらいの愛情だ……愛情の……筈だ……。
考えれば考えるほどに頬が熱くなり、また私はベッドの上で身悶えする。
『いや、何があったのさ？あんだけ男子はちょっと怖いって言ってた七海が手を繋いで登校って……』
『うらやましぃぃ〜。私も彼氏と手繋ぎ登校したいにゃ〜……無理だけど……』
今朝、初美と歩に状況を尋問された時に言われた言葉だ……初美、そんなのこっちが聞きたいよ。
歩は私と陽信が手を繋いで登校したのが羨ましいようだった。
確かにただの登校なのに……すごい楽しかった。
いや、友達との登校も楽しいけど、また違った楽しさだった。歩はこれを自分ができないのに、私がやってるとか……羨ましがるよね確かに……。
とりあえず私は、昨日あったことを全部説明した。陽信が私を助けてくれたことも含めて、全部……。
『へぇ……やるじゃん簾舞。そこで助けられてガチ惚れしちゃったわけですかー、七海はー。いやー……そっかー……。私らの心配ってガチで当たってたんじゃね？……チョロすぎで心配で、七海残して専門行けそうになかったって……』
『七海はチョロチョロさんだね～、ほんとほんと……。でも、やっぱり簾舞を選んで正解だったねー。いざって時に頼りになりそうだし、七海にはお似合いだねぇ』
チョロいとは失礼な。
ただ、陽信を褒められたのが嬉しくて……私はその後も彼のことをさんざん二人に語ってしまっていた……。まだ付き合って2日目のくせに……。
喋りすぎて我に返った私を二人はニヤニヤと……でも安心したように見守ってくれていた。
なんだかあれは、罰ゲームの報告と言うよりも……。
「普通の……恋バナだったよね……？初めてしたなぁ……三人で恋バナ……楽しかったなぁ……」
陽信に連絡する前も三人で喋っていた。
三人での恋バナ……主に私がしゃべりすぎてた気もするけど……二人は私の言葉をちゃんと聞いてくれていた。
そして、もっとグイグイ行っても良いんじゃないとか無責任なアドバイスを受けた。あれ以上は今の私には無理だから！
最終的には『惚気はもういいから簾舞に連絡してやりな……』と言われてしまったのだが……。
そんなに惚気てたのかな私……？ちょっと恥ずかしい。
それから陽信と話して……デートに誘われたわけだ……土曜日は先約があると言ったら……なぜか急に敬語になって私をデートに誘ってきてくれた。
本当は、日曜日のデートは私から誘おうと思ったのに……うかうかしてたら先を越されてしまった気分だ。ちょっと悔しい。
でも、陽信からデートに誘われた。それがたまらなく嬉しい。
嬉しすぎる。
なんでこんなに嬉しいの？
デート……初デートかぁ……日曜日は初デート……。浮つく気持ちが止められない。
「明日のお弁当は……気合い入れないとなぁ……あ、でもまだ、お母さん達にはバレないようにしないと……」
お弁当のお礼なんて気にしなくて良いのに、私が好きでやって……。
好きで？誰が好きで？いや、私は料理が好きで、そして彼女の練習としてやってるだけなんですけどね？
……我ながら無理のある言い訳かも、と自覚する。
ともかく、たまらなく浮かれる自分の心を律するように、私は明日のお弁当について考える。
陽信はハンバーグが良いと言っていた。飛び切り大きいのを焼いてあげよう。お弁当箱に入るかな？
卵焼きも好きなのかな？そういえば、甘いのとしょっぱいのどっちが好きなんだろう……今日、好みを聞いておけばよかったかも。
ご飯はおにぎりにしようか……それとも……桜でんぶでハート型……。
……うん、ハート型は私がちょっと恥ずかしくて作れないし……万が一見つかった時に何を言われるかわからないから……おにぎりにしよう。
香草系以外はなんでも食べられるって言ってたけど……色々あって好みを聞く余裕が持てなかったからなぁ……。
明日はもっといろんなことを話したい。
陽信のことはたくさん知りたいし……私のことはたくさん知ってほしい……。
でもそうなると……。
「一ヶ月って……短いなぁ……」
自分でも知らないうちに呟いていた。
『無理に付き合い続ける必要はないけど、別にそのまま付き合い続けちゃったっていいんだよ？』
この罰ゲームを提案された時に言われた言葉だ。
最初は、私は一ヶ月も付き合わなきゃいけないのと思って憂鬱になっていた。
そもそも相手の男子にも悪いし……その間に何をしていいかわからなかったからだ。
でも今は違う。一ヶ月をとても短く感じている。
たった一日で、気持ちってこんなに変わるのと、私自身が驚いている。
タピオカとか陽信と一緒に飲んでみたい。きっと彼は飲んだことがないだろから、色々教えてあげたい。
私の料理をもっと食べてもらいたい。お弁当だけじゃなく、出来立ての料理を食べてもらいたいのだ。
……その場合……私は……彼の家に行くのかな？考えただけで緊張する。
付き合い続ければイベント事だって沢山あるんだ。
お祭りとか一緒に行くのも楽しそうだし、ハロウィンに、クリスマスやバレンタインだって……。
やりたい事、やってあげたい事、やってほしい事……それを考えると本当に一ヶ月は短いと感じられてしまうのだ。
『キスは明日しちゃうの？』
「まだしないから！できないから！」
再び頭の中に出てきた初美と歩に反論する。
叫んでベッドの上でバッタンバッタン暴れていたらお母さんに注意されてしまった。
いけないいけない……冷静に冷静に……。
陽信は私と違って冷静だったなあ……学校での彼はおとなしいと思ってたけど、実は大人っぽかったってことなのかな？
きっと私が、電話中も内心ドキドキで緊張しているのなんて知らないんだろうな。
あぁでも、慌てた声も聞けたっけ？その後に、改めて誘ってくれた時になんで敬語だったんだろ？
もしも私と同じように実は緊張してたなら…おんなじで嬉しいかな？
一ヶ月後……私はどうしたいのだろうか？
これがバレて陽信が私から離れていったらと思うと……とても怖い。
考えただけで、泣きそうになる。
「……私って、チョロいのかなぁ？」
答える人のいない質問は、そのまま私の中だけで消化されていく。
そんなことはきっと無い……私はチョロく無い……と思いつつも……今も陽信の事ばっかり考えている私は、二人の言葉に反論できないということだけは自覚していた。
だから私は一つのことを決めた。アドバイス通り……グイグイ行くのだ。
「陽信には私の事を大好きになってもらおう!!胃袋掴んで！いっぱい遊んで！……キスはまだ恥ずかしくて無理だけど！そうすれば、私から離れていかないはず！」
我ながら最低だとは思う。
これが罰ゲームから始まったものだと分かっても陽信が許してくれるように……その前に彼の心を完全に掴むのだ。
陽信には、私をメロメロに好きになってもらうんだから。
……まだ打ち明ける勇気が持てない私にできる、これが精一杯の努力だ。
「そうと決まれば明日もお弁当作りだ！うん、気合い入れるぞー！」
ベッドの上に立ち上がり騒いでいたら、またお母さんに怒られた。
でも、方針も決まったし、もう私に迷いは無い！
そして、私はそのままベッドに潜り込んで眠りにつく。良い夢が……陽信の夢が見られるといいな。
……いや、待って私……夢の中でもって……。やっぱり、私ってチョロいのかな……？
";

    let lines = text.lines();
    let mut tokenizer = Tokenizer::new().unwrap();

    for line in lines {
        println!("{}", line);

        // tokenize the text
        let tokens = tokenizer.tokenize(line).unwrap();

        // output the tokens
        for token in tokens {
            println!("{} {:?} {}", token.text, token.pos, token.lemma);
        }
    }
}
